app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]
---
	def destroy
		@tag = Tag.find(params[:name])

		@tag.destroy